[
  {
    "productId": "book1",
    "name" : "Harry Potter and the sorcerers stone",
    "author": "JK Rowling",
    "category": "Fiction",
    "description": "But not everything is quiet at Hogwarts as Harry suspects someone is planning to steal the sorcerer's stone. On his eleventh birthday, Harry Potter discovers that he is no ordinary boy. Hagrid, a beetle-eyed giant, tells Harry that he is a wizard and has a place at Hogwarts School of Witchcraft and Wizardry.",
    "popularity" : "high",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book2",
    "name" : "Harry Potter and the Chamber of Secrets",
    "author": "JK Rowling",
    "category": "Fiction",
    "description": "Forced to spend his summer holidays with his muggle relations, Harry Potter gets a real shock when he gets a surprise visitor: Dobby the house-elf, who warns Harry Potter against returning to Hogwarts, for terrible things are going to happen. Harry decides to ignore Dobby's warning and continues with his pre-arranged schedule. But at Hogwarts, strange and terrible things are indeed happening: Harry is suddenly hearing mysterious voices from inside the walls, muggle-born students are being attacked, and a message scrawled on the wall in blood puts everyone on his/her guard",
    "popularity" : "high",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book3",
    "name" : "Harry Potter And The Prisoner Of Azkaban",
    "author": "JK Rowling",
    "category": "Fiction",
    "description": "In the summer before his third year at Hogwarts, Harry Potter becomes fed up with his horrible aunt and uncle, and after accidentally inflating his visiting aunt Marge, he runs away. Unfortunately, there's much more danger in the wizarding world than harry thought; convicted mass murderer, Sirius Black, has escaped from the wizarding prison Azkaban. Black is known as Lord Voldemort's most devoted follower, and he's after Harry to avenge Voldemort and finish the job. But not everything is what it seems, and inside of Hogwarts there may just be a traitor...",
    "popularity" : "high",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book4",
    "name" : "Product Name: Harry Potter And The Goblet of Fire",
    "author": "JK Rowling",
    "category": "Non Fiction",
    "description": "After a lonely summer on Privet Drive, Harry returns to a Hogwarts full of ill-fortune. Few of students and parents believe him or Dumbledore that Voldemort is really back. The ministry had decided to step in by appointing a new Defence Against the Dark Arts teacher that proves to be the nastiest person Harry has ever encountered. Harry also can't help stealing glances with the beautiful Cho Chang. To top it off are dreams that Harry can't explain, and a mystery behind something Voldemort is searching for. With these many things Harry begins one of his toughest years at Hogwarts School of Witchcraft and Wizardry.",
    "popularity" : "high",
    "onsale": "no",
    "price" : 21.99
  },
    {
    "productId": "book5",
    "name" : "Harry Potter And The Order of the Phoenix",
    "author": "JK Rowling",
    "category": "Non Fiction",
    "description": "But not everything is quiet at Hogwarts as Harry suspects someone is planning to steal the sorcerer's stone. On his eleventh birthday, Harry Potter discovers that he is no ordinary boy. Hagrid, a beetle-eyed giant, tells Harry that he is a wizard and has a place at Hogwarts School of Witchcraft and Wizardry.",
    "popularity" : "high",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book6",
    "name" : "Harry Potter And The Half-Blood Prince",
    "author": "JK Rowling",
    "category": "Non Fiction",
    "description": "After a lonely summer on Privet Drive, Harry returns to a Hogwarts full of ill-fortune. Few of students and parents believe him or Dumbledore that Voldemort is really back. The ministry had decided to step in by appointing a new Defence Against the Dark Arts teacher that proves to be the nastiest person Harry has ever encountered. Harry also can't help stealing glances with the beautiful Cho Chang. To top it off are dreams that Harry can't explain, and a mystery behind something Voldemort is searching for. With these many things Harry begins one of his toughest years at Hogwarts School of Witchcraft and Wizardry.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book7",
    "name" : "Harry Potter And The Deathly Hollows",
    "author": "JK Rowling",
    "category": "Non Fiction",
    "description": "Soon after questioning Ollivander, Harry begins to truly understand what he's meant to do. He's supposed to destroy the Horcruxes and not go after the Elder Wand. He then has a vision of what Voldemort's doing. Voldemort is at Hogwarts and has figured out that Dumbledore was the possessor of the Elder Wand.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book8",
    "name" : "IT",
    "author": "JK Rowling",
    "category": "Non Fiction",
    "description": "They were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But the promise they made twenty-eight years ago calls them reunite in the same place where, as teenagers, they battled an evil creature that preyed on the city's children. Now, children are being murdered again and their repressed memories of that terrifying summer return as they prepare to once again battle the monster lurking in Derry's sewer.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  },
    {
    "productId": "book9",
    "name" : "With In",
    "author": "JK Rowling",
    "category": "Fiction",
    "description": "Sobriety brings the past memories. Quitting is the easy part. As your body and mind returns, The reasons come back to the start. With selections ranging from tales of despair and abuse to equally moving accounts of celebration and love, the author repeatedly affirms her faith in God and the human ability to persevere. Revealing and frank, With In is a portrait of the struggles and joys of life. About the Author Janine Mary Stefanucci-Hexter lives in New Jersey with her husband and is the mother of three. She has been writing since childhood and often carries paper with her to write down ideas. In addition, she is well ranked by the American Poolplayers Association and loves music, dancing, swimming, softball, and rollercoasters.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book10",
    "name" : "The Time Traveler's Wife",
    "author": "Audrey Niffenegger",
    "category": "Fiction",
    "description": "The beloved, mega bestselling first novel from Audrey Niffenegger, a soaring celebration of the victory of love over time (Chicago Tribune). A MOST UNTRADITIONAL LOVE STORY, this is the celebrated tale of Henry DeTamble, a dashing, adventuresome librarian who inadvertently travels through time, and Clare Abshire, an artist whose life takes a natural sequential course. Henry and Clare's passionate affair endures across a sea of time and captures them in an impossibly romantic trap that tests the strength of fate and basks in the bonds of love.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  },
    {
    "productId": "book11",
    "name" : "The Complete Bocuse",
    "author": "JK Rowling",
    "category": "Cooking",
    "description": "The unequivocal reference tome on the full spectrum of twentieth-century French cooking, interpreted and revised by master chef Paul Bocuse for the home cook. Celebrated chef Paul Bocuse is the authority on classic French cuisine. In this volume, he shares 500 simple, traditional French recipes. Aimed at the beginner but with enough breadth to entice the confident chef, these recipes can be readily prepared at home and emphasize the use of the freshest and simplest ingredients. The book is divided into twenty-two chapters, fourteen covering savory recipes and eight covering sweet recipes, with everything from soups to souffles, by way of terrines, fish, meat, and vegetables. Practical appendixes include average cooking times for different types of meat, conversion tables, and a glossary of key French culinary terms.",
    "popularity" : "normal",
    "onsale": "yes",
    "price" : 21.99
  },
  {
    "productId": "book12",
    "name" : "Gok Cooks Chinese",
    "author": "JK Rowling",
    "category": "Cooking",
    "description": "Not only is Gok Wan one of the UK's top fashion stylists, but he can cook too! Gok's fantastic book, Gok Cooks Chinese, contains 80 personal and family recipes, which are not only delicious and healthy but incredibly simple to make. Gok's love and passion for Chinese food and cooking techniques shine through from every page. From his unique perspective he gives us his personal and modern take on the Chinese food that he grew up eating, drawing on his Chinese heritage to give us a different angle on how to eat - for Gok, it's all about sitting down, tucking into fantastic food that is fuss-free and relaxed. Gok's food is about balance, health, flavour and fun. From his absolute favourite recipe for Prawn Wonton Noodle Soup (which he calls 'happiness in a bowl') to Perfect Fried Rice or classics like his dad's Honey-glazed Char Siu Pork, through chapters on Dim Sum, Street Food, One Pot Wonders and Feasting, you will find recipes for all occasions and moods, whether entertaining friends or enjoying a meal at home by yourself. Above all, Gok Wan will demystify Chinese ingredients and equipment. Gok Cooks Chinese shows us how easy it is to shop and cook just like him.",
    "popularity" : "normal",
    "onsale": "yes",
    "price" : 21.99
  },
  {
    "productId": "book13",
    "name" : "Jamie Oliver the Naked Chef",
    "author": "JK Rowling",
    "category": "Cooking",
    "description": "Jamie Oliver's classic bestselling book, with simple recipes that combine bold flavours and nutritious fresh ingredients The Naked Chef teaches you how to make beautiful dishes from scratch, whether you're cooking for guests or simply enjoying good food with your family. Host a dinner party your friends won't forget with light Vegetable Tempura, followed by melt-in-the-mouth spiced Slow-Cooked Lamb Shank. Or why not try the Chilli, Tomato, Oregano and Pancetta Pizza; perfect for getting the family stuck in. This book has something for everyone - from those who want great food but want to keep it simple, to those who work for a living and don't have time to spend all evening cooking. The Naked Chef is all about giving people confidence and getting them to feel at ease in the kitchen, with the help of Jamie Oliver, even if they have never tried cooking before! 'Simply brilliant cooking, and Jamie's recipes are a joy' Nigel Slater 'There is only one Jamie Oliver. Great to watch. Great to cook' Delia Smith.",
    "popularity" : "normal",
    "onsale": "yes",
    "price" : 21.99
  },
  {
    "productId": "book14",
    "name" : "Nigella Bites",
    "author": "JK Rowling",
    "category": "Cooking",
    "description": "Nigella Collection: a vibrant new look for Nigella's classic cookery books. 'Cooking isn't performance art - or shouldn't be. Make your food welcoming rather than fussy and remember that it's not a test of your worth and acceptability: it's just dinner, and can be easily delicious.' Packed with fresh ideas and exciting new twists on old favourites, Nigella Lawson brings you mouthwatering but simple recipes to add flavour to your busy life - from quick family meals and easy suppers to dinner party menus and roast lunches. With luscious photography, evocative food writing and a beautiful hardback design, this is a book you will treasure for many years as well as a delicious gift for friends and family. Features: All-Day Breakfast - recipes to start the day right, whatever time you get up!; Comfort Food - from chocolate fudge cake to mashed potato; TV Dinners - quick meals and simple snacks; Party Girl - cupcakes, barbecue chicken and much more to help you celebrate in style; Rainy Days - family meals to savour and share, and how to feel warm in the kitchen when it's cold outside; Trashy - kitsch in the kitchen and fun food; Legacy - recipes from Nigella's family Suppertime - dinner party ideas that let you relax; Slow-Cook Weekend - the joys of slow roasting and languorous baking: roast pork, sticky toffee pudding and all the trimmings; and Templefood - recipes to refresh and restore, and make you feel serenely smug.",
    "popularity" : "normal",
    "onsale": "yes",
    "price" : 21.99
  },
    {
    "productId": "book15",
    "name" : "Nadiyas Kitchen",
    "author": "JK Rowling",
    "category": "Cooking",
    "description": "From breakfasts to dinners to a cake fit for the Queen. Having fallen in love with Nadiya and her outstanding bakes on 2015's Great British Bake Off, readers can now discover all her favourite recipes. With chapters ranging from 'Lazy Sunday Mornings' to 'Midnight Feasts', 'Snacks and Sharing' to 'Dessert for Dinner', you'll find ideas for any time of the day, and for all the family. Nadiya offers innovative twists on traditional classics and failsafe recipes for many staple meals and bakes, including: Best Fish Finger Butty Crumpets with Salted Honey Butter Wellington Sausage Rolls Cod and Clementine Curry Mustardy Kale Mac and Cheese Popcorn, White Chocolate and Peanut Slice Spiced Parsnip and Orange Cake And not forgetting: 'Her Majesty's Cake', based on the delight she created for the Queen's 90th birthday.",
    "popularity" : "normal",
    "onsale": "yes",
    "price" : 21.99
  },
  {
    "productId": "book16",
    "name" : "Auckland City & Districts Pathfinder Map 100",
    "author": "JK Rowling",
    "category": "New Zealandn",
    "description": "Auckland Central city and a complete regional district map - a great base map for Auckland.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book17",
    "name" : "Above Auckland",
    "author": "JK Rowling",
    "category": "New Zealand",
    "description": "Spread over a narrow isthmus, Auckland is one of the few cities in the world where two coasts are visible from the air. Using the latest drone technology, David Wall's photographs show an up-to-the-minute view of the pace of urban development in Auckland, and showcase a city of stunning scenic diversity.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book18",
    "name" : "Adele 19",
    "author": "JK Rowling",
    "category": "Music",
    "description": "(Piano/Vocal/Guitar Artist Songbook). British songstress Adele stormed onto the music scene in 2008, and was named Best New Artist at the Grammy Awards in 2009. All the songs from her debut album titled 19 to reflect her age at the time the album was released are included in our folio. Includes her hit Chasing Pavements plus 11 others: Best for Last * Crazy for You * Daydreamer * Hometown Glory * Melt My Heart to Stone * Right As Rain * Tired * and more. Includes black-and-white photos.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  },
    {
    "productId": "book19",
    "name" : "Botanica",
    "author": "JK Rowling",
    "category": "Gardening",
    "description": "Botanica is the universal standard work for garden enthusiasts and botanists alike. The collaboration of a team of international experts has resulted in a reference work that illustrates the rich diversity of our flora with a myriad of indigenous and exotic plants. More than 10,000 genera and species - from A for Abelia to Z for Zygopetalum - are clearly presented in a well-organized manner. Richly illustrated with color detail and large-format images, this botanical alphabet offers all kinds of information about starting, caring for, reproducing and propagating plants as well as their appearance and special qualities. A glossary and an index of the English names and various synonyms allow you easy access to species and families. This book is not only addressed to seasoned botanists in search of a reliable companion, but also to hobby gardeners and interested readers who want to spruce up their own gardens or deepen their botanical knowledge.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  },
  {
    "productId": "book20",
    "name" : "Africation",
    "author": "JK Rowling",
    "category": "Education",
    "description": "The O.A.U now the A.U had 40yrs as the only path to African unification. Its about time an alternate path to the same goal be available this is what Africation is all about.",
    "popularity" : "normal",
    "onsale": "no",
    "price" : 21.99
  }
]
